{
 "Name" : "Dan Costinett",
 "Bio" : "Open to New Opportunities",
 "Location" : "Bothell, Washington, United States",
 "Present Company" : "Seattle University",
 "About" : "Experienced Android Developer with a demonstrated history of working in the hospital & health care industry. Experience working in enterprise and start-up-sized companies with a preference for start-ups. Skilled in Mobile Applications, Test Planning, Java, Kotlin, C#, Visual Studio, and Scrum. Strong engineering professional with an MS focused in Software Engineering from Seattle University.  Experienced Android Developer with a demonstrated history of working in the hospital & health care industry. Experience working in enterprise and start-up-sized companies with a preference for start-ups. Skilled in Mobile Applications, Test Planning, Java, Kotlin, C#, Visual Studio, and Scrum. Strong engineering professional with an MS focused in Software Engineering from Seattle University.",
 "Experience" : "Android Developer Albertsons · Contract Jan 2023 - Nov 2023 · 11 mos Remote Skills: Android · REST APIs · Kotlin Android · REST APIs · Kotlin Senior Android Engineer Axon · Full-time Nov 2021 - Oct 2022 · 1 yr Seattle, Washington, United States Skills: REST APIs REST APIs Sr. Android Developer Xevo Inc. · Full-time Mar 2020 - Nov 2021 · 1 yr 9 mos Skills: REST APIs REST APIs Sr. Android Developer BaseMap Inc Aug 2019 - Jan 2020 · 6 mos Bothell, Wa Skills: REST APIs REST APIs Sr. Android Developer ReachNow · Full-time May 2019 - Jul 2019 · 3 mos Greater Seattle Area ReachNow is the joint venture for car sharing and mobility between BMW and Daimler. Skills: REST APIs REST APIs Sr. Android Developer Kforce Inc May 2018 - May 2019 · 1 yr 1 mo ReachNow Seattle Android developer lead at ReachNow Seattle. Skills: REST APIs REST APIs Android Developer Providence Health & Services Feb 2017 - May 2018 · 1 yr 4 mos Greater Seattle Area Developing new consumer health care apps Skills: REST APIs REST APIs Android Engineer Sinclair Broadcast Group Jan 2016 - Feb 2017 · 1 yr 2 mos Android application development Skills: REST APIs REST APIs Software Engineer (Android) Disney Aug 2014 - Dec 2015 · 1 yr 5 mos Seattle, WA Android application development Skills: REST APIs REST APIs Senior SDET Limelight Networks Oct 2012 - Aug 2014 · 1 yr 11 mos Web service application testing Skills: REST APIs REST APIs SDET Microsoft Apr 2007 - Oct 2012 · 5 yrs 7 mos Software Developer in Test Motorola Apr 2005 - Mar 2007 · 2 yrs Software Test Engineer Motorola Inc. Seattle 2004 - 2006 · 2 yrs Testing back-end service for mobile devices. Software Developer thePlatform Mar 2001 - Apr 2005 · 4 yrs 2 mos Tester thePlatform for Media, Inc (subsidiary of Comcast Interactive Media) 2001 - 2005 · 4 yrs Support Engineer Attachmate 1994 - 1996 · 2 yrs",
 "Education" : "Seattle University MS, Software Engineering 2001 - 2003 Masters of Software Engineering Kiski University of Washington",
 "Licenses & certifications" : "Java Web and Distributed Application Development UW Professional & Continuing Education Issued Aug 2015  Android Application Development UW Professional & Continuing Education Issued Jun 2015  C++ Programming UW Professional & Continuing Education Issued Jun 2012 ",
 "Skills" : "REST APIs 10 experiences across Albertsons and 9 other companies Kotlin Android Developer at Albertsons Test Automation Endorsed by 6 colleagues at Limelight Networks Endorsed by 6 colleagues atLimelight Networks 25 endorsements Agile Methodologies 25 endorsements Scrum 15 endorsements Software Engineering 20 endorsements Test Planning 10 endorsements Software Development 30 endorsements Software Quality Assurance 5 endorsements Testing 29 endorsements C# 5 endorsements Visual Studio 4 endorsements Java 8 endorsements Object Oriented Design 4 endorsements C++ 3 endorsements Software Design 5 endorsements .NET 4 endorsements XML 4 endorsements Debugging 3 endorsements Web Services 7 endorsements "
}