{
 "Name" : "Jonathan Norori",
 "Bio" : "Software Developer at NASA - National Aeronautics and Space Administration",
 "Location" : "New York, New York, United States",
 "Present Company" : "NASA - National Aeronautics and Space Administration",
 "Highest Education" : "Inter American University of Puerto Rico, Bayamon",
 "About" : "I'm a Software Developer that is highly motivated in approaching challenging projects and developing effective and creative solutions. I have experience as a full-stack software engineer designing attractive and responsive applications and websites, as well as knowledge of cloud tools and services including AWS and Azure.  Skilled in several programming languages and technologies including Java, C#, JavaScript, SQL, HTML, CSS, React, Node.js, Angular, ASP.NET MVC, and Amazon Web Services including Lambda, S3, and API Gateway.  I’m very interested in the constant growth of technology and I continuously look forward to learn and acquire new knowledge in this area. I enjoy to continue building my skills and always welcome new and complex challenges sent my way",
 "Experience" : "Experience NASA - National Aeronautics and Space Administration Full-time · 5 yrs 1 mo Software Developer Feb 2022 - Present · 2 yrs 2 mos Houston, Texas, United States Software/Computer Engineer Nov 2019 - Feb 2022 · 2 yrs 4 mos Houston, Texas Area • Working in the Infrastructure and Applications Office in the Information Resources Directorate at NASA Johnson Space Center supporting the design, hardware, and development of enterprise server and network engineering projects; and integrating the planning, programming, oversight, and overall resource management for multi-phase projects. • Collaborating with other engineers responsible for project management, analytical investigations, and quality assurance duties for Johnson Space Center infrastructure. • Evaluating relevancy of networking technologies, server hardware systems, and services, and participating in technical solutions assessments. Systems Engineer Mar 2019 - Nov 2019 · 9 mos Houston, Texas Area • Worked for NASA Johnson Space Center via MORI Associates as part of the COMIT contract. Supported NASA’s JSC Information Resources Directorate projects by developing software and web applications written in C#, ASP.NET MVC, Entity Framework, LINQ, SQL, JavaScript, HTML, and CSS. • Created an Action Item Tracking System for the Engineering Directorate using React, Node.js, Express.js, JavaScript, SQL, and Amazon Web Services including Lambda, S3, RDS, and API Gateway. • Collaborated with other developers and engineers on projects using Git and GitLab. Software Developer Pimsoft · Full-time May 2018 - Mar 2019 · 11 mos Houston, Texas Area • Assisted in the development of the Sigmafine Visualization app that improves data quality for process and manufacturing industries using Angular and adding new components to enhance its capabilities. • Worked extensively with cloud tools, applications, and services including Microsoft Azure and created Virtual Machines using PowerShell and the Azure Portal. • Developed .NET applications written in C# as well as tested windows desktop apps and performed bug fixes to improve its performances. NASA - National Aeronautics and Space Administration Internship · 10 mos Knowledge Management Intern Jan 2018 - May 2018 · 5 mos Houston, Texas • Created the Johnson Space Center (JSC) History Portal Website for the History Office using PHP, JavaScript, jQuery, Bootstrap, HTML, and CSS; which contains access to the JSC Oral History Transcripts, the JSC History Collection database, and hundreds of NASA history web pages. • Designed and managed the database for the JSC History Portal Website using MySQL. • Developed a web application using C#, ASP.NET MVC, JavaScript, HTML, and CSS that inputs new collected data from the JSC Oral History Transcripts into the JSC History Portal Website, providing an efficient way of adding new content into the database and website. Computer Software Developer Intern Aug 2017 - Dec 2017 · 5 mos Greenbelt, Maryland • Contributed to full-stack web development projects using PHP, JavaScript, jQuery, SQL, HTML, and CSS, that helped assist the Strategic Partnership Office (SPO) in facilitating the input and access of their data. • Implemented and managed databases for the web applications using MySQL resulting in a better organization of its content. • Supported the SPO website by utilizing the Content Management System (CMS) WordPress. LAN Technology Support Office (LTSO) Intern U.S. Census Bureau · Internship Jun 2017 - Aug 2017 · 3 mos Suitland, Maryland • Resolved conflicts encountered in computers including both software and hardware by troubleshooting and providing diagnostics. • Completed designated tasks through assignments of remedy tickets submitted through the IT Service Desk. • Configured and supported Census Laptops and PCs, including McAfee End Point Encryption administration and managing existing network accounts. • Participated in IT inventory management and activities including preparing, shipping, and receiving IT equipment.",
 "Education" : "Inter American University of Puerto Rico, Bayamon Bachelor of Science, Computer Science 2017 Honors: Cum Laude, Dean's List 2016-2017",
 "Skills" : " Python (Programming Language) 1 endorsement Amazon Web Services (AWS) 1 endorsement C# 1 endorsement Java Software Development Web Development Mobile Applications Android Development Database Design Cloud Computing Data Structures Object-Oriented Programming (OOP) Information Technology Systems Engineering JavaScript PHP React.js Node.js Angular jQuery "
}