{
 "Name" : "Tom Batzold",
 "Bio" : "Staff Software Engineer, Technical Fellow at Northrop Grumman",
 "Location" : "Baltimore City County, Maryland, United States",
 "Present Company" : "Northrop Grumman",
 "Highest Education" : "Rochester Institute of Technology",
 "About" : "Embedded software engineer and architect working primarily in C++ on some of the most complex systems and challenges.   Previously a software developer with extensive experience developing enterprise Java applications using JEE and Spring (MVC, IoC, Security), XML programming (DOM/SAX, XSLT, XPATH), Web Services (REST and SOAP based), HTML and JavaScript, C++, C, and Python. Interested in cybersecurity, software architecture, engineering, design and frameworks, problem solving, mathematics, and process improvement.  Not currently interested in returning to Java or web-based development",
 "Experience" : "Northrop Grumman Full-time · 3 yrs 10 mos Staff Software Engineer Sep 2022 - Present · 1 yr 7 mos Skills: C++ · Embedded Systems · Embedded Software C++ · Embedded Systems · Embedded Software Senior Principal Software Engineer Jun 2020 - Sep 2022 · 2 yrs 4 mos Skills: C++ · Embedded Systems · Embedded Software C++ · Embedded Systems · Embedded Software Executive Officer Army National Guard May 2019 - Aug 2021 · 2 yrs 4 mos Glenville, NY Software Assurance Evaluation Engineer Minerva Engineering May 2018 - Jun 2020 · 2 yrs 2 mos Baltimore, Maryland Area Skills: C++ C++ Platoon Leader / Liaison Officer New York Army National Guard Sep 2014 - Apr 2019 · 4 yrs 8 mos 2LT/1LT reaponsible for planning training that nests within Commanders intent, and planning and executing missions. Liaison Officer responsible for representing 2-108 IN BN to the 27TH IBCT. Empowered by BN Commander to influence IBCT planning based on intimate knowledge of BN plans and combat capabilities. Responsible for developing relationships with IBCT warfighting functions, enablers and support sections to enhance BN combat power and ensure successful mission completion.  2LT/1LT reaponsible for planning training that nests within Commanders intent, and planning and executing missions. Liaison Officer responsible for representing 2-108 IN BN to the 27TH IBCT. Empowered by BN Commander to influence IBCT planning based on intimate knowledge of BN plans and combat capabilities. Responsible for developing relationships with IBCT warfighting functions, enablers and support sections to enhance BN combat power and ensure successful mission completion. Senior Software Engineer Novetta Mar 2017 - Apr 2018 · 1 yr 2 mos Aberdeen Proving Ground, Maryland Software Assurance, Research and Development Skills: C++ C++ Senior Software Engineer InsPro Technologies Sep 2016 - Mar 2017 · 7 mos Greater Philadelphia Area Chase 2 yrs 1 mo Application Developer May 2015 - Sep 2016 · 1 yr 5 mos - Write code and integrate new technologies into existing applications - Interview potential hires - Plan software development timelines - Deliver artifacts and deploy applications - Provide L3 support directly to customers to ensure availability of applications - Write code and integrate new technologies into existing applications - Interview potential hires - Plan software development timelines - Deliver artifacts and deploy applications - Provide L3 support directly to customers to ensure availability of applications Contract Developer Sep 2014 - May 2015 · 9 mos Application development/SDLC activities in an Agile environment Army National Guard 3 yrs 4 mos 2LT Jun 2013 - Dec 2014 · 1 yr 7 mos Responsible for planning and executing training in accordance with Commander's vision and intent. Officer Candidate Sep 2011 - Jun 2013 · 1 yr 10 mos Attended leadership training Paychex 3 yrs 8 mos Software Developer II Feb 2013 - Sep 2014 · 1 yr 8 mos Analysis, requirements gathering, software development. Implement software components in Java, Oracle SQL, JavaScript, JSP, HTML, XML and proprietary frameworks. Software Developer Feb 2011 - Feb 2013 · 2 yrs 1 mo Analysis, design and implementation of various business requirements and services in Java and SQL. Software Support and Development Lincware Aug 2010 - Feb 2011 · 7 mos Software support, technical support, software development in Javascript, Java, HTML. Substitute Teacher West Irondequoit Central School District Sep 2009 - Jun 2010 · 10 mos Rochester, New York Area Substitue teacher primarily placed in Math and Science classes. Software Development Co-op Thomson West Nov 2006 - May 2007 · 7 mos Java programming co-op. Worked mainly on XML projects using SAX.",
 "Education" : "Rochester Institute of Technology BS, Computer Science & Computational Mathematics 2005 - 2011 Activities and societies: Fencing Club, Math Club, TA for Mathematics courses, Research Computing tech support Abstract Algebra/Number Theory concentration in Mathematics. Cryptography focus in Computer Science Johns Hopkins Whiting School of Engineering Master of Science - MS, Cybersecurity 2018 - 2020 Johns Hopkins Whiting School of Engineering Master's degree, Cybersecurity May 2020 Johns Hopkins Whiting School of Engineering Master of Science - MS, Cybersecurity  Master of Science - MS, Cybersecurity Jan 2018 - May 2020 Skills: C++ C++ Johns Hopkins Whiting School of Engineering Master of Science - MS, Cybersecurity Jan 2017 - May 2020",
 "Licenses & certifications" : "ICS-100 FEMA Issued Nov 2017",
 "Skills" : "  Embedded Systems 2 experiences at Northrop Grumman Embedded Software 2 experiences at Northrop Grumman Java Endorsed by 2 colleagues at Army National Guard Endorsed by 2 colleagues atArmy National Guard 6 endorsements Software Development 5 endorsements Programming 5 endorsements Object Oriented Design 3 endorsements Web Development 1 endorsement Troubleshooting Software Development Life Cycle (SDLC) Software Project Management Agile & Waterfall Methodologies Project Management Web Services Requirements Analysis Military Operations Military Training Reporting & Analysis Integration Shell Scripting Data Modeling ",
 "Courses" : "Computability 4005 898 Computational Complexity 4005 702 Cryptography 4005 705 Cryptography II 4005 706 Independent Study in Approximation Algorithms 4005 890 Introduction to Continuum Theory 1016 599 Numerical Linear Algebra 1016 712 Theory of Comp Algorithms 4005 800",
 "Honors & awards" : "Distinguished Military Graduate Jun 2013 Associated with Army National Guard Distinguished Military Graduate of Army Officer Candidate School. Finished in the top 20% of physical, academic and leadership, with 100% first-time success rate on all events."
}